{
  "posts": [
    {
      "id": 1,
      "author": "Лев Толстой",
      "title": "Война и мир",
      "fullDescription": "Писать о сюжете романа-эпопеи — авантюрная затея. Есть эпические шансы не уложиться в ограниченное количество строк. Поэтому опишем «Войну и мир» как физики, а не лирики. Ведь физики лаконичны даже тогда, когда говорят о Вселенной. Итак, Кутузов и Наполеон — это два магнитных полюса. Пусть отдельные силовые линии в пространстве между ними будут действующими лицами романа. Таких насчитывается 569. В это число входят все классы общества, все возрасты и характеры; автор анализирует их жесты, мимику и даже мысли. А общее магнитное поле условимся считать народом, или, в зависимости от проявления его в романе, толпой. Вся эта чудесная физика взаимодействует и живет в объеме одной книги, но всегда дарит новые подробности наблюдателю, как если бы он пристально вглядывался в вещи и видел за молекулами атомы, а за ними — элементарные частицы. И затем бы укладывал увиденное в общую картину мира и словно бы чувствовал странный магнетизм — но уже не приборами, а самой душой.",
      "picture": "/pictures/books/WarAndPeace.webp"
    },
    {
      "id": 2,
      "author": "Джордж Оруэлл",
      "title": "1984",
      "fullDescription": "Джордж Оруэлл — один из самых читаемых в мире авторов и очень противоречивая персона своего времени. Родился в Бенгалии, учился в Итоне, работал в полиции, на радио и в букинистическом магазине, воевал в Испании и писал книги. Ярый противник коммунизма и защитник демократического социализма, Оруэлл устроил бунт против общества, к которому так стремился, но в котором чувствовал себя абсолютно чужим.Что будет, если в правящих кругах распространятся идеи фашизма и диктатуры? Каким станет общественный уклад, если власть потребует неуклонного подчинения? К какой катастрофе приведет подобный режим?В государстве Океания у граждан нет прав, а значит, власть партии абсолютна. Повседневная жизнь героев проходит в условиях страха и постоянных потрясений. Здесь перечеркнуты свобода слова, свобода печати, свобода выбора, свобода любви и даже свобода мысли. Нарушить порядок невозможно, ведь Большой Брат смотрит за каждым. Ужасы преступлений государственной машины зафиксировал Джордж Оруэлл в своем главном творении — «1984». Этот роман-предупреждение об опасности тоталитаризма стал одной из самых известных антиутопий XX века, которая стоит в одном ряду с «Мы» Замятина, «О дивный новый мир» Хаксли и «451° по Фаренгейту» Брэдбери.Культовая антиутопия XX века и главное произведение Джорджа Оруэлла заиграет новыми красками благодаря иллюстрациям художника Вадима Белобородова, нарисованным специально для данного издания. Макет книги органично поддерживает иллюстрации: красивый, простой, жесткий, как и сам роман.",
      "picture": "/pictures/books/1984.jpg"
    },
    {
      "id": 3,
      "author": "Джеймс Джойс",
      "title": "Улисс",
      "fullDescription": "Роман 'Улисс' великого ирландского писателя Джеймса Джойса, классика и одновременно разрушителя канонов классики, – произведение-эксперимент, знаковое, яркое явление, вершина литературы модернизма ХХ века и главная веха в современном искусстве прозы.Попадая на улицы Дублина, читатель оказывается, на первый взгляд, в замкнутом мире странным образом объединенных героев: молодого писателя Стивена Дедала и рекламного агента Леопольда Блума. Постепенно картина начинает проясняться, явные и скрытые аналогии с 'Одиссеей' Гомера позволяют расшифровать символический код автора.Виртуозный язык, фейерверк стилей и техник письма, авторская ирония, исторические и мифологические аллюзии - с момента выхода в свет и по сей день 'Улисс' остается вызовом Писателя Читателю.В настоящее издание включены наиболее полные на сегодняшний день комментарии Сергея Хоружего.",
      "picture": "/pictures/books/ulysses.webp"
    },
    {
      "id": 4,
      "author": "Джейн Остен",
      "title": "Гордость и предубеждение",
      "fullDescription": "Культовый роман Джейн Остен был неоднократно экранизирован и входит в списки величайших книг всех времен. Что делает историю отношений умной и гордой Элизабет Беннет и не менее гордого мистера Дарси столь популярной? Англия, конец XVIII века. Родители пятерых сестер Беннет озабочены тем, чтобы удачно выдать дочерей замуж. Размеренная жизнь семейства переворачивается вверх дном, когда по соседству появляется молодой джентльмен — мистер Бингли. Среди друзей нового соседа оказывается немало утонченных аристократов, которые не прочь поухаживать за очаровательными сестрами. Своевольная Элизабет знакомится с красивым и высокомерным мистером Дарси. Между ними разгорается нешуточное противостояние, результатом которого может стать как любовь, так и ненависть. Смогут ли они преодолеть все разногласия и недоразумения? И все-таки что же вот уже несколько веков заставляет читателей смеяться и плакать, трепетать от гнева и радоваться?На первый взгляд, «Гордость и предубеждение» — любовный роман. Однако это и веселая комедия, и история взросления, и социальная критика, и философская притча. Роман чрезвычайно остроумен. Тонкий юмор и изящный стиль изложения не позволяют ему утратить своего неподражаемого очарования и блеска. Многочисленные драматические повороты совершенно не дают оторваться от чтения. К тому же каждая страница пропитана духом Англии. С невероятной иронией и удивительной наблюдательностью Джейн Остен описывает быт провинциального общества, особенности этикета и манер. С большим мастерством подлинного художника она раскрывает душевую жизнь героев, вглядывается в причины и побуждения. Следить за тем, как меняется персонаж под влиянием тех или иных событий, невероятно увлекательно.",
      "picture": "/pictures/books/PrideAndPrejudice.webp"
    },
    {
      "id": 5,
      "author": "Данте Алигьери",
      "title": "Божественная комедия",
      "fullDescription": "Данте Алигьери — великий итальянский поэт, мыслитель, автор знаменитой «Комедии» (позднее названной «Божественной»). В годы политического изгнания, на «половине жизненного пути», Данте создал бессмертную «Божественную комедию», величайший памятник поэтической культуры и настоящую энциклопедию средневекового мировоззрения. Автор поэмы представлен в ней как человек, удостоившийся Божьей милости совершить путешествие к Господу через три царства загробного мира — путешествие от мрачного неблагополучия греховности и сомнений к счастью истины и светлого идеала.",
      "picture": "/pictures/books/TheDivineComedy.jpg"
    },
    {
      "id": 6,
      "author": "Джонатан Свифт",
      "title": "Путешествия Гулливера",
      "fullDescription": "«Библиотека школьной классики» — элегантная, изящная серия книг, необходимых в каждом доме. Каждый том серии — это встреча с прекрасным, которая запомнится навсегда. Подарочное издание. Твёрдый переплёт с вырубкой и тиснением фольгой. Белая бумага. Чёткий удобочитаемый шрифт. Роман английского писателя Джонатана Свифта «Путешествия Гулливера» с первой публикации покорил читателей. Далёкие острова, удивительные страны и их необыкновенные обитатели вызывали восхищение у миллионов поклонников, среди которых были даже такие известные личности, как Лев Толстой и Максим Горький. В эту книгу вошли истории о двух самых известных путешествиях Лемюэля Гулливера: в Лилипутию и в страну великанов Бробдингнег. Остроумные и точные рассуждения автора о правилах жизни в фантастических мирах предлагают читателям самим подумать, кем же удобнее быть: лилипутом или гигантом.",
      "picture": "/pictures/books/Gulliver'sTravels.jpg"
    },
    {
      "id": 7,
      "author": "Дж. Д. Сэлинджер",
      "title": "Над пропастью во ржи",
      "fullDescription": "Мальчика зовут Холден Колфилд, и живет он в повести «Над пропастью во ржи», до сих пор боготворимой миллионами «непонятых» подростков. Холден наделен «абсолютным нравственным слухом» — он мгновенно различает фальшь, с него словно содрана кожа, обнажены нервные окончания, его сверхчувствительность — особого рода радар, улавливающий то, мимо чего спокойно проходят другие. Но он не ангел и не «дитя цветов», а трудный подросток во всей красе: со своими переживаниями, волнениями и талантами, но и со всеми «тараканами» тоже. Но у Холдена есть еще и странная, но очень трогательная мечта.",
      "picture": "/pictures/books/Catcher.jpeg"
    },
    {
      "id": 8,
      "author": "Маргарет Митчелл",
      "title": "Унесенные ветром",
      "fullDescription": "«Унесенные ветром» — история красавицы южанки, женщины с твердым характером, которая борется за личное счастье и благополучие, пока привычный мир вокруг гибнет. Беззаботную юность Скарлетт О'Хары унесли могучие ветры Гражданской войны. В один миг девушке пришлось повзрослеть: шум балов сменился грохотом канонад, мать умерла, отец сошел с ума, родное поместье опустело. Однако Скарлетт, капризную и своенравную, но, вместе с тем, сильную и отчаянную, не сломить ни любовным неудачам, ни сложностям жизни, ни грузу ответственности за близких. Ее пленительное обаяние и невероятная целеустремленность помогут пережить все испытания и обрести веру в себя. 'Унесенные ветром' - история красавицы южанки, женщины с твердым характером, которая борется за личное счастье и благополучие, пока привычный мир вокруг гибнет. Беззаботную юность Скарлетт О'Хары унесли могучие ветры Гражданской войны. В один миг девушке пришлось повзрослеть: шум балов сменился грохотов канонад, мать умерла, отец сошел с ума, родное поместье опустело. Однако Скарлетт, капризную и своенравную, но, вместе с тем, сильную и отчаянную, не сломить ни любовным неудачам, ни сложностям жизни, ни грузу ответственности за близких. Ее пленительное обаяние и невероятная целеустремленность помогут пережить все испытания и обрести веру в себя.",
      "picture": "/pictures/books/WithWind.jpg"
    },
    {
      "id": 9,
      "author": "Джон Стейнбек",
      "title": "Гроздья гнева",
      "fullDescription": "Том Джоуд после четырёхлетнего тюремного срока в колонии за убийство возвращается домой в Оклахому. По пути он встречает Кейси — бывшего проповедника. Они вместе направляются домой к Тому. Вернувшись домой, Том не обнаруживает родителей, но встречает Мьюли, который рассказывает о том, что всех людей выгнали с земли, родители уехали в Калифорнию, а он остался здесь один. На следующее утро Том и Кейси направляются к дому дяди Джона. Там его встречает всё семейство: мать, отца, дядю Джона, Ноя, Розу Сарона и Конни, Эла и двое малых детей. В это время приезжает представитель компании, из-за которого всех людей оставили без дома, и говорит дяде Джону, что до следующего дня дом надо освободить. Ночью семья забивает весь свой скот, собирает вещи и на грузовике уезжает в сторону Калифорнии в поисках работы. Мьюли остаётся, принимая одиночество. У дедушки Тома в пути случается сердечный приступ, и он умирает. Семья хоронит его у дороги. После они останавливаются в лагере, где незнакомец рассказывает, что в Калифорнии работы нет и что из-за этого его близкие погибли от голода. Семья продолжает путь. По дороге в Калифорнию умирает и бабушка Тома. В пограничье у реки Ной принимает решение уйти, считая, что самостоятельно может прокормиться у реки.",
      "picture": "/pictures/books/GrapesWrath.webp"
    },
    {
      "id": 10,
      "author": "Олдос Хаксли",
      "title": "О дивный новый мир",
      "fullDescription": "'О дивный новый мир' - изысканная и остроумная антиутопия о генетически программируемом 'обществе потребления', в котором разворачивается трагическая история Дикаря - 'Гамлета' этого мира.Роман Олдоса Хаксли 'О дивный новый мир' (1932) – одна из классических антиутопий. Разделенное на касты общество потребления не признает отклонения от выработанной нормы, поэтому никак не может вписаться в него тот, кто еще сохранил в себе остатки человечности – Дикарь. Действие романа разворачивается в Лондоне далёкого будущего (в 26 веке нашей эры, а именно в 2540 году[4]. Люди на всей Земле живут в едином «прогрессирующем» государстве, где возведены в основу следующие ценности: беззаботность (работа не принята во внимание по причине естественного желания ей заниматься), сексуальная свобода и потребление. Отсчитывается новое летоисчисление — Эра Т — с появления Форда Т. Потребление возведено в культ, символом потребительского бога выступает Генри Форд, а вместо крестного знамения люди «осеняют себя знаком Т».",
      "picture": "/pictures/books/NewWorld.jpg"
    },
    {
      "author": "Гарсиа Маркес",
      "title": "Сто лет одиночества",
      "fullDescription": "На протяжении романа всем его героям назначено судьбой страдать от одиночества, которое является врождённым «пороком» семьи Буэнди́а. Селение, где происходит действие романа, Макондо, также одинокое и отделённое от современного ему мира, живёт в ожидании визитов цыган, привозящих с собой новые изобретения, и в забвении, в постоянных трагических событиях в истории культуры, описанной в произведении.\nОдиночество более всего заметно в полковнике Аурелиано Буэнди́а, поскольку его неспособность выражать свою любовь заставляет его уходить на войну, оставляя своих сыновей от разных матерей в разных селениях. В другом эпизоде он просит начертить вокруг него трёхметровый круг, и чтобы к нему никто не приближался. Подписав мирный договор, он стреляет себе в грудь, чтобы не встречаться со своим будущим, но из-за своей неудачливости не достигает цели и проводит свою старость в мастерской, изготавливая золотых рыбок в честном согласии с одиночеством.",
      "picture": "/pictures/books/book2.jpg",
      "id": 11
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "bill",
      "password": "123"
    },
    {
      "id": 2,
      "username": "lol",
      "password": "123",
      "name": "Вася",
      "email": "skdj@dj.com",
      "image": "sos"
    },
    {
      "id": 3,
      "username": "any",
      "password": "123"
    },
    {
      "username": "www",
      "password": "111",
      "id": 4
    },
    {
      "username": "qqq",
      "password": "qqq",
      "id": 5
    }
  ]
}